---
kind: property
id: P:Autodesk.Revit.DB.Visual.Metal.MetalPerforationsShader
source: html/397f8955-f8d8-feb3-3772-3615786f48a6.htm
---
# Autodesk.Revit.DB.Visual.Metal.MetalPerforationsShader Property

The property labeled "Image" from the "Metal" schema.

## Syntax (C#)
```csharp
public static string MetalPerforationsShader { get; }
```

## Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.